var carsAndModels = {};
carsAndModels['تهران'] = ['لطفا شهر را انتخاب نمایید' ,'احمدآبادمستوفي', 'ادران', 'اسلام آباد','اسلام شهر','اكبرآباد','اميريه' 
,'انديشه','اوشان','آبسرد','آبعلي','باغستان','باقر شهر' ,'برغان','بومهن','پارچين','پاكدشت','پرديس','پرند','پس قلعه',
'پيشوا','تجزيه مبادلات لشكر  ','تهران','جاجرود' ,'چرمسازي سالاريه' ,'چهاردانگه' ,'حسن آباد' ,'حومه گلندوك' , 'خاتون آباد' ,'خاوه' ,
'خرمدشت' ,'دركه' , 'دماوند' ,'رباط كريم' , 'رزگان' ,'رودهن' ,'ري' ,'سعيدآباد' , 'سلطان آباد' ,'سوهانك','شاهدشهر' ,'شريف آباد' ,'شمس آباد' , 
'شهر قدس' ,'شهرآباد' ,'شهرجديدپرديس' ,'شهرقدس(مويز)' , 'شهريار' , 'شهرياربردآباد' ,'صالح آباد' ,'صفادشت' , 'فرودگاه امام خميني' ,'فرون آباد' ,'فشم' ,'فيروزكوه' ,
'قرچك' , 'قيام دشت' , 'كهريزك' ,'كيلان' ,'گلدسته' ,'گلستان (بهارستان)' ,'گيلاوند' ,'لواسان' ,'لوسان بزرگ' ,'مارليك' , 'مروزبهرام' , 'ملارد' , 
'منطقه 11 پستي تهران' ,'منطقه 13 پستي تهران' ,'منطقه 14 پستي تهران' ,'منطقه 15 پستي تهران' ,'منطقه 16 پستي تهران' ,'منطقه 17 پستي تهران  ' ,'منطقه 18 پستي تهران  ' ,
'منطقه 19 پستي تهران  ' ,'نسيم شهر (بهارستان)' ,'نصيرآباد' , 'واوان' , 'وحيديه' , 'ورامين' ,'وهن آباد' ,];



carsAndModels['گیلان'] = ['لطفا شهر را انتخاب نمایید' ,'احمد سرگوراب' , 'اسالم' ,'اسكلك' ,'اسلام آباد' ,'اطاقور' ,'املش' ,'آبكنار' ,'آستارا' ,'آستانه اشرفيه' ,'بازاراسالم' ,'بازارجمعه شاندرمن' ,'برهسر' ,
'بلترك' ,'بلسبنه' ,'بندرانزلي' ,'پاشاكي' ,'پرهسر' ,'پلاسي' ,'پونل' , 'پيربست لولمان' ,'توتكابن' ,'جوكندان' ,'جيرنده' ,'چابكسر' ,'چاپارخانه' ,'چوبر' ,'خاچكين' ,
'خشك بيجار' ,'خطبه سرا' ,'خمام' ,'ديلمان' ,'رانكوه' ,'رحيم آباد' ,'رستم آباد' , 'رشت' , 'رضوان شهر' ,'رودبار' ,'رودسر' , 'سراوان' ,'سنگر' ,'سياهكل' ,
'شاندرمن' ,'شفت' ,'صومعه سرا' ,'طاهر گوداب' ,'طوللات' ,'فومن' , 'قاسم آبادسفلي' ,'كپورچال' , 'كلاچاي' , 'كوچصفهان' ,'كومله' ,'كياشهر' ,'گشت' ,'لاهيجان' ,
'لشت نشا' ,'لنگرود' , 'لوشان' ,'لولمان' ,'لوندويل' ,'ليسار' ,'ماسال' , 'ماسوله' ,'منجيل' ,'هشتپر ـ طوالش' ,'واجارگاه' , ];

carsAndModels['آذربایجان شرقی'] = ['لطفا شهر را انتخاب نمایید' ,'ابشاحمد' ,'اذغان' ,'اسب فروشان' ,'اسكو' ,'اغچه ريش' , 'اقمنار' ,'القو' ,'اهر' ,'ايلخچي' ,'آذرشهر' ,'باسمنج' ,
'بخشايش ـ كلوانق' ,'بستان آباد' ,'بناب' ,'بناب جديد ـ مرند' ,'تبريز' ,'ترك' ,'تسوج' ,'جلفا' ,'خامنه' ,'خداآفرين' ,'خسروشهر' ,'خضرلو' , 'خلجان' ,'سبلان' , 'سراب' ,
'سردرود' ,'سيس' ,'شادبادمشايخ' ,'شبستر' ,'شربيان' ,'شرفخانه' ,'شهر جديد سهند' ,'صوفيان' ,'عجب شير' ,'قره اغاج ـ چاراويماق' , 'قره بابا' , 'كردكندي' , 'كليبر' ,
'كندرود' ,'كندوان' ,'گوگان' ,'مراغه' ,'مرند' , 'ملكان' ,'ممقان' , 'ميانه' ,'هاديشهر' , 'هريس' , 'هشترود' ,'هوراند' ,'ورزقان' ,];



carsAndModels['خوزستان'] = ['لطفا شهر را انتخاب نمایید' , 'اروندكنار' , 'اميديه' ,'انديمشك' ,'اهواز' , 'ايذه' ,'آبادان' ,'آغاجاري' ,'باغ ملك' ,
'بندرامام خميني' ,'بهبهان' ,'جايزان' ,'جنت مكان' ,'چمران ـ شهرك طالقاني ' ,'حميديه' ,'خرمشهر' ,'دزآب' ,'دزفول' ,'دهدز' , 'رامشير' , 'رامهرمز' ,'سربندر' ,'سردشت' , 
'سماله' , 'سوسنگرد ـ دشت آزادگان' ,'شادگان' ,'شرافت' , 'شوش' ,'شوشتر' ,'شيبان' ,'صالح مشطت' ,'كردستان بزرگ' , 'گتوند' ,'لالي' ,'ماهشهر' ,'مسجد سليمان' , 'ملاثاني' ,
'ميانكوه' ,'هفتگل' , 'هنديجان' ,'هويزه' ,'ويس' ,];


carsAndModels['فارس'] = ['لطفا شهر را انتخاب نمایید' , ' بيضا' , 'اردكان ـ سپيدان' , 'ارسنجان' ,'استهبان' ,'اشكنان ـ اهل' ,'اقليد' ,'اكبرآبادكوار' ,'اوز' ,'ايزدخواست' ,
'آباده' ,'آباده طشك' ,'بالاده' , 'بانش' ,'بنارويه' ,'بهمن' ,'بوانات' ,'بوانات(سوريان)' ,'بيرم' ,'جنت شهر(دهخير)' ,'جهرم' ,'جويم' , 'حاجي آباد ـ زرين دشت' ,'حسن آباد' , 
'خرامه' ,'خرمی' ,'خشت' ,'خنج' ,'خيرآبادتوللي' ,'داراب' ,'داريان' ,'دهرم' ,'رونيز ' , 'زاهدشهر' , 'زرقان' ,'سروستان' , 'سعادت شهر ـ پاسارگاد' ,'سيدان' ,'ششده' ,
'شهر جديد صدرا' ,'شيراز' ,'صغاد' ,'صفاشهر ـ خرم بيد' ,'طسوج' , 'علاءمرودشت' ,'فدامي' , 'فراشبند' ,'فسا' , 'فيروزآباد' ,'فيشور' , 'قادرآباد' ,'قائميه' , 
'قطب آباد' ,'قطرويه' ,'قير و كارزين' ,'كازرون' ,'كام فيروز' ,'كلاني' ,'كنارتخته' ,'كوار' ,'گراش' , 'گويم' ,'لار ـ لارستان' , 'لامرد' , 'مبارك آباد' ,'مرودشت' , 
'مشكان' , 'مصيري ـ رستم' ,'مظفري' ,'مهر' , 'ميمند' ,'نورآباد ـ ممسني' ,'ني ريز' ,'وراوي' ,];

carsAndModels['اصفهان'] = ['لطفا شهر را انتخاب نمایید' ,'ابريشم' ,'ابوزيدآباد' ,'اردستان' , 'اريسمان' ,'اژيه' ,'اسفرجان' ,'اسلام آباد' ,'اشن' ,'اصغرآباد' ,'اصفهان' ,'امين آباد' ,
'ايمان شهر' ,'آران وبيدگل' ,'بادرود' ,'باغ بهادران' ,'بهارستان' ,'بوئين ومياندشت' ,'پيربكران' ,'تودشك' , 'تيران' ,'جعفرآباد' , 'جندق' ,'جوجيل' ,'چادگان' ,'چرمهين' ,
'چمگردان' ,'حسن اباد','خالدآباد' ,'خميني شهر' ,'خوانسار' ,'خوانسارك' , 'خور' ,'خوراسگان' ,'خورزوق' ,'داران ـ فريدن' ,'درچه پياز' ,'دستگردوبرخوار' , 'دهاقان' ,'دهق' ,
'دولت آباد' ,'ديزيچه' ,'رزوه' , 'رضوان شهر' ,'رهنان' ,'زاينده رود' , 'زرين شهر ـ لنجان' ,'زواره' ,'زيار' ,'زيبا شهر' ,'سپاهان شهر' ,'سده لنجان' , 'سميرم' ,'شاهين شهر' , 
'شهرضا' , 'شهرك صنعتي مورچ' , 'شهرك مجلسي' ,'شهرک صنعتي محمودآباد' ,'طالخونچه' , 'عسگران' ,'علويچه' , 'غرغن' , 'فرخي' ,'فريدون شهر' ,'فلاورجان' ,'فولادشهر' ,'فولادمباركه' ,
'قهد ريجان' ,'كاشان' , 'كليشادوسودرجان' , 'كمشچه' ,'كوهپايه' , 'گز' , 'گلپايگان' ,'گلدشت' ,'گلشهر' ,'گوگد' , 'مباركه' ,'مهاباد' ,'مورچه خورت' ,'ميمه' ,'نائين' ,
'نجف آباد' , 'نصر آباد' , 'نطنز' ,'نيك آباد' ,'بهارستان' , 'هرند' ,'ورزنه' , 'ورنامخواست' ,'ویلاشهر' ,];

carsAndModels['خراسان رضوی'] = ['لطفا شهر را انتخاب نمایید' , 'ابدال آباد' , 'ازادوار' ,'باجگيران' ,'باخرز' ,'باسفر' ,'بجستان' ,'بردسكن' , 'برون' ,'بزنگان' ,
'بند قرائ' ,'بيدخت' ,'تايباد' ,'تربت جام' ,'تربت حيدريه' ,'جغتاي' , 'جنگل' ,'چمن آباد' ,'چناران' ,'خليل آباد' ,'خواف' ,'داورزن' ,'درگز' , 'دولت آباد ـ زاوه' ,'رادكان' ,
'رشتخوار' ,'رضويه' , 'ريوش(كوهسرخ)' , 'سبزوار' , 'سرخس' , 'سلطان آباد' ,'سنگان' ,'شانديز' ,'صالح آباد' ,'طرقبه ـ بينالود' ,'طوس سفلي' ,'فريمان' ,'فيروزه ـ تخت جلگه' ,'فيض آباد ـ مه ولات' , 
'قاسم آباد' ,'قدمگاه' , 'قوچان' ,'كاخك' ,'كاشمر' ,'كلات' ,'گلبهار' ,'گناباد' ,'لطف آباد' ,'مشهد' , 'مشهدريزه' ,'مصعبي' ,'نشتيفان' ,'نقاب ـ جوين' , 'نيشابور' ,'نيل شهر' ,];

carsAndModels['قزوین'] = ['لطفا شهر را انتخاب نمایید' , 'َآوج' ,'ارداق' ,'اسفرورين' ,'اقباليه' ,'الوند ـ البرز' ,'آبگرم' ,'آبيك' , 'آقابابا' ,'بوئين زهرا' ,'بیدستان' , 'تاكستان' ,'حصاروليعصر' ,
'خاكعلي' ,'خرم دشت' ,'دانسفهان' , 'سيردان' , 'شال' ,'شهر صنعتي البرز' , 'ضياآباد' ,'قزوين' ,'ليا' , 'محمديه' ,'محمود آباد نمونه' , 'معلم كلايه' , 'نرجه' ,];



carsAndModels['سمنان'] = ['لطفا شهر را انتخاب نمایید' , 'ارادان' , 'اميريه' ,'ايوانكي' ,'بسطام' , 'بيارجمند' ,'خيرآباد' , 'دامغان' ,'درجزين' ,'سرخه' , 'سمنان' , 'شاهرود' , 'شهميرزاد' ,
'گرمسار' , 'مجن' ,'مهدي شهر' , 'ميامي' ,'ميغان' , ];


carsAndModels['قم'] = ['لطفا شهر را انتخاب نمایید' , 'دستجرد' ,'سلفچگان' , 'شهر جعفریه' ,'قم' , 'قنوات' ,'كهك' ,];


carsAndModels['مرکزی'] = ['لطفا شهر را انتخاب نمایید' ,'اراك' , 'آستانه' ,'آشتيان' ,'تفرش' ,'توره' ,'جاورسيان' ,'خسروبيك' ,'خشك رود' ,'خمين' ,'خنداب' ,'دليجان' ,
'ريحان عليا' ,'زاويه' ,'ساوه' ,'شازند' ,'شهراب' , 'شهرك مهاجران' ,'فرمهين' ,'كميجان' ,'مامونيه ـ زرنديه' , 'محلات' ,'ميلاجرد' ,'هندودر' ,];

carsAndModels['زنجان'] = ['لطفا شهر را انتخاب نمایید' , ' آب بر ـ طارم' ,'ابهر' , 'اسفجين' ,'پري' ,'حلب' ,'خرمدره' ,'دستجرده' ,'دندي' , 'زرين آباد ـ ايجرود' ,'زرين رود' ,
'زنجان' ,'سلطانيه' ,'صائين قلعه' ,'قيدار' ,'گرماب' , 'گيلوان' , 'ماهنشان' , 'همايون' ,'هيدج' ,];


carsAndModels['مازندران'] = ['لطفا شهر را انتخاب نمایید' ,'اسلام آباد' , 'اميركلا' ,'ايزدشهر' ,'آمل' ,'آهنگركلا' ,'بابل' ,'بابلسر' ,'بلده' ,'بهشهر' , 'بهنمير' ,'پل سفيد ـ سوادكوه' ,'تنكابن' ,
'جويبار' ,'چالوس' ,'چمستان' ,'خرم آباد' , 'خوشرودپی' ,'رامسر' ,'رستم كلا' ,'رويانشهر' ,'زاغمرز' ,'زرگر محله' ,'زيرآب' , 'سادات محله' ,'ساري' ,'سرخرود' , 'سلمانشهر' , 
'سنگده' ,'سوا' , 'سورك' ,'شيرگاه' ,'شيرود' ,'عباس آباد' , 'فريدون كنار' ,'قائم شهر' ,'كلارآباد' ,'كلاردشت' ,'كيا كلا' ,'كياسر' , 'گزنك' , 'گلوگاه' ,'گهرباران' ,'محمودآباد' ,
'مرزن آباد' ,'مرزي كلا' ,'نشتارود' ,'نكاء' ,'نور' ,'نوشهر' ,];


carsAndModels['گلستان'] = ['لطفا شهر را انتخاب نمایید' ,'انبار آلوم' , 'اينچه برون' ,'آق قلا' , 'بندر گز' ,'سيمين شهر' ,'علي آباد' ,'فاضل آباد' ,'گميش تپه' ,'مراوه تپه' ,'آزادشهر' ,'بندرتركمن' ,
'جلين' ,'خان ببين' ,'راميان' ,'كردكوي' ,'كلاله' ,'گاليكش' ,'گرگان' ,'گنبدكاوس' ,'مينودشت' ,];



carsAndModels['اردبیل'] = ['لطفا شهر را انتخاب نمایید' ,'ابي بيگلو' ,'بيله سوار' ,'پارس آباد' ,'مشگين شهر' ,'اردبيل' ,'اصلاندوز' ,'تازه كند انگوت' ,'جعفرآباد' ,'خلخال' ,'سرعين' ,'شهرك شهيد غفاري' , 'كلور' ,
'كوارئيم' ,'گرمي ' ,'گيوي ـ كوثر' ,'لاهرود' ,'نمين' ,'نير' ,'هشتجين' ,];


carsAndModels['آذربایجان غربی'] = ['لطفا شهر را انتخاب نمایید' ,'اروميه' ,'اشنويه' ,'ايواوغلي' ,'بازرگان' ,'بوكان' ,'پسوه' ,'پيرانشهر' ,'تكاب' ,'خوي' ,'ديزج' ,'ربط' ,
'زيوه' ,'سردشت' ,'سلماس' ,'سيلوانا' ,'سيلوه' ,'شوط' ,'قوشچي' ,'ماكو' ,'مهاباد' ,'مياندوآب' ,'مياوق' ,'ميرآباد' ,'نقده' ,'پلدشت' ,'تازه شهر' ,
'چهاربرج قديم' ,'ديزجديز' ,'سيه چشمه ـ چالدران' ,'شاهين دژ' ,'قره ضياء الدين ـ چايپاره' ,'كشاورز (اقبال)' ,'محمد يار' ,'محمودآباد' , 'نوشين شهر' ,];

carsAndModels['همدان'] = ['لطفا شهر را انتخاب نمایید' ,'ازندريان' ,'اسدآباد' ,'بهار' ,'تويسركان' ,'دمق' ,'رزن' ,'سامن' ,'سركان' ,'فامنين' ,'قهاوند' ,'گيان' ,'لالجين' ,
'ملاير' ,'نهاوند' ,'همدان' ,'اسلام آباد' ,'پايگاه نوژه' ,'شيرين سو' ,'صالح آباد' ,'قروه درجزين' ,'كبودرآهنگ' ,];



carsAndModels['کردستان'] = ['لطفا شهر را انتخاب نمایید' ,'بانه' ,'بيجار' ,'دلبران' ,'دهگلان' ,'ديواندره' ,'سروآباد' ,'سقز' ,'سنندج' ,'قروه' ,'كامياران' ,'مريوان' ,'موچش' ,'اورامانتخت' , 'بلبان آباد' ,
'سريش آباد' ,];


carsAndModels['کرمانشاه'] = ['لطفا شهر را انتخاب نمایید' ,'باينگان' ,'بيستون' ,'پاوه' ,'جوانرود' ,'روانسر' ,'ريجاب' ,'سنقر' ,'صحنه' ,'فرامان' ,'فش' ,'قصرشيرين' ,'كرمانشاه' ,'كنگاور' ,'گيلانغرب' ,
'نودشه' ,'هرسين' ,'هلشي' ,'اسلام آباد غرب' ,'تازه آباد ـ ثلاث باباجاني' ,'سراب ذهاب' ,'سرپل ذهاب' ,];


carsAndModels['لرستان'] = ['لطفا شهر را انتخاب نمایید' ,'دورود' ,'اليگودرز' ,'برخوردار' ,'بروجرد' ,'پل دختر' ,'چغلوندی' ,'چقابل' ,'ازنا' ,'زاغه' ,'سپيددشت' ,'كوناني' ,'كوهدشت' ,'معمولان' ,'الشتر ـ سلسله' ,
'تقي آباد' ,'خرم آباد' ,'شول آباد' ,'نورآباد ـ دلفان' ,'واشيان نصيرتپه' ,];


carsAndModels['بوشهر'] = ['لطفا شهر را انتخاب نمایید' ,'ابدان' ,'آباد' ,'آبپخش' ,'بادوله' ,'بردخون' ,'بندردير' ,'بندرديلم' ,'بندرريگ' ,'بندركنگان' ,'بندرگناوه' ,'بوشهر' ,'جم' ,'چغارك' ,'دلوار' ,'ريز' ,
'سعدآباد' ,'شبانكاره' ,'شنبه' ,'شول' ,'عسلويه' ,'كاكي' ,'كلمه' ,'وحدتيه' ,'اهرم ـ تنگستان' ,'برازجان ـ دشتستان' ,'تنگ ارم' ,'جزيره خارك' ,'خورموج ـ دشتي' ,'عالی شهر' ,
'نخل تقي' ,];


carsAndModels['کرمان'] = ['لطفا شهر را انتخاب نمایید' ,'انار' ,'باغين' ,'بافت' ,'بردسير' ,'بلوك' ,'بم' ,'بهرمان' ,'پاريز' ,'جوشان' ,'جيرفت' ,'چترود' ,'خانوك' ,'دوساري' ,'رابر' ,'راور' ,
'راين' ,'رفسنجان' ,'رودبار' ,'ريگان' ,'زرند' ,'سرچشمه' ,'سريز' ,'سيرجان' ,'شهربابك' ,'صفائيه' ,'عنبرآباد' ,'فارياب' ,'فهرج' ,'كرمان' ,'كهنوج' ,'كوهبنان' ,
'ماهان' ,'اختيارآباد' ,'ارزوئیه' ,'امين شهر' , 'جواديه فلاح' ,'زنگي آباد' ,'قلعه گنج' , 'كاظم آباد' , 'كهنوج( مغزآباد)' ,'كيان شهر' ,'محمدآباد ـ ريگان' ,'محي آباد' ,
'منوجان' ,'نجف شهر' ,'نگار' ,];


carsAndModels['هرمزگان'] = ['لطفا شهر را انتخاب نمایید' ,'ابوموسي' ,'ايسين' ,'بستك' ,'بندرخمير' ,'بندرعباس' ,'بندرلنگه' ,'پارسيان' ,'پدل' ,'تياب' ,'جاسك' ,'جزيرهلارك' ,'جناح' ,
'چارك' ,'درگهان' ,'دشتي' ,'رويدر' ,'سندرك' ,'سيريك' ,'فارغان' ,'فين' ,'قشم' ,'كنگ' ,'كيش' ,'ميناب' ,'بندزك كهنه' ,'پل شرقي' ,'جزيره سيري' ,'جزيره لاوان' ,
'جزيره هنگام' ,'حاجي آباد' ,'دهبارز ـ رودان' ,'زيارت علي' ,'سردشت ـ بشاگرد' ,];



carsAndModels['چهارمحال و بختیاری'] = ['لطفا شهر را انتخاب نمایید' ,'اردل' ,'آلوني' ,'باباحيدر' ,'بروجن' ,'بلداجي' ,'بن' ,'جونقان' ,'چالشتر' ,'دزك' ,'دستنائ' ,'دشتك' ,'سامان' ,
'سودجان' ,'سورشجان' ,'شهركرد' ,'فارسان' ,'فرادنبه' ,'فرخ شهر' ,'كیان' ,'گندمان' ,'گهرو' ,'لردگان' ,'ناغان' ,'هاروني' ,'هفشجان' ,'وردنجان' ,'چلگرد ـ كوهرنگ' ,'شلمزار ـ كيار' ,
'مال خليفه' ,];


carsAndModels['یزد'] = ['لطفا شهر را انتخاب نمایید' ,'احمدآباد' ,'عشق آباد' ,'هرات ـ خاتم' ,'ابركوه' , 'اردكان' ,'بافق' ,'بفروئيه' ,'بهاباد' ,'تفت' ,'حميديا' ,'زارچ' ,'شاهديه' ,'صدوق' ,'طبس' ,'فراغه' ,'مروست' ,'مهريز' ,'ميبد' ,
'نير' ,'يزد' ,];


carsAndModels['سیستان و بلوچستان'] = ['لطفا شهر را انتخاب نمایید' ,'دوست محمد ـ هيرمند' ,'سوران ـ سيب سوران' ,'گلمورتي ـ دلگان' ,'نصرت آباد' ,
'نيك شهر' ,'اسپكه' ,'ايرانشهر' ,'بزمان' ,'بمپور' ,'بنت' ,'بنجار' ,'پسكو' ,'تيموراباد' ,'جالق' ,'چابهار' ,'خاش' ,'راسك' ,'زابل' ,
'زابلي' ,'زاهدان' ,'زهك' ,'ساربوك' ,'سراوان' ,'سرباز' ,'سنگان' ,'سيركان' ,'فنوج' ,'قصرقند' ,'كنارك' ,'كيتج' ,'گوهركوه' ,'محمدآباد' ,'ميرجاوه' ,'نگور' ,
'هيدوچ' ,];


carsAndModels['ایلام'] = ['لطفا شهر را انتخاب نمایید' ,'آسمان آباد' ,'چشمه شيرين' ,'دره شهر' ,'سرابله ـ شيروان و چرداول' ,
'شهرك اسلاميه' ,'اركواز' ,'ارمو' ,'ايلام' ,'ايوان' ,'آبدانان' ,'بدره' ,'توحيد' ,'چوار' ,'دهلران' ,'شباب ' , 'لومار' ,'مهران' ,'موسيان' ,'ميمه' ,];


carsAndModels['کهگلویه و بویراحمد'] = ['لطفا شهر را انتخاب نمایید' ,'دهدشت ـ كهگيلويه' ,'دوگنبدان ـ گچساران' ,'سي سخت ـ دنا' ,'قلعه رئيسي' ,
'ياسوج ـ 7591' ,'باشت' ,'پاتاوه' ,'چرام' ,'ديشموك' ,'سپيدار' ,'سوق' ,'لنده' ,'ليكك' ,'مادوان' ,];


carsAndModels['خراسان شمالی'] = ['لطفا شهر را انتخاب نمایید' , 'اسفراين' , 'آشخانه ـ مانه و سلمقان' ,'ايور' ,'بجنورد' ,'جاجرم' ,'درق' ,'راز' ,'شوقان' ,'شيروان' ,'فاروج' ,'گرمه' ,];



carsAndModels['خراسان جنوبی'] = ['لطفا شهر را انتخاب نمایید' ,'اسديه ـ درميان' ,'آرين شهر' ,'حاجي آباد' ,'خضري دشت بياض' , 'سر بیشه' , 'سه قلعه' ,
'قائن ـ قائنات' ,'ارسك' ,'آيسك' ,'بشرويه' ,'بیرجند' ,'خوسف' ,'زهان' ,'سرايان' ,'فردوس' ,'گزيک' ,'مود' ,'نهبندان' ,'نیمبلوك' ,];


carsAndModels['البرز'] = ['لطفا شهر را انتخاب نمایید' ,'اشتهارد' ,'آسارا' ,'چهارباغ' ,'سيف آباد' , 'شهر جديد هشتگرد' , 'طالقان' ,'كرج' ,'كمال شهر' ,'كوهسار ـ چندار' ,'گرمدره' ,
'ماهدشت' ,'محمدشهر' ,'مشکين دشت' ,'نظرآباد' ,'هشتگرد ـ ساوجبلاغ' ,];




function ChangeCarList() {
    var carList = document.getElementById("car");
    var modelList = document.getElementById("carmodel");
    var selCar = carList.options[carList.selectedIndex].value;
    while (modelList.options.length) {
    modelList.remove(0);
    }
    var cars = carsAndModels[selCar];
    if (cars) {
    var i;
    for (i = 0; i < cars.length; i++) {
    var car = new Option(cars[i], cars[i]);
    modelList.options.add(car);
    }
}
} 



